{
    "eventName": "GetCostAndUsage",
    "eventSource": "ce.amazonaws.com",
    "awsService": "CostExplorer",
    "description": "Retrieves cost and usage metrics for your account.",
    "mitreAttackTactics": [
        "TA0007 - Discovery"
    ],
    "mitreAttackTechniques": [
        "T1526 - Cloud Service Discovery"
    ],
    "mitreAttackSubTechniques": [],
    "unverifiedMitreAttackTechniques": [
        {
            "technique": "T1082 - System Information Discovery",
            "reason": "The attacker calls the GetCostAndUsage API to gather detailed usage information about the AWS resources being utilized. By analyzing the cost and usage data, the attacker can infer details about the types of services, their usage patterns, and potentially the structure of the environment."
        },
        {
            "technique": "T1518 - Software Discovery",
            "reason": "By reviewing the cost and usage metrics, the attacker identifies expenditures related to security services (e.g., GuardDuty, CloudTrail). This information helps the attacker understand the security posture and tools in use, potentially avoiding or disabling them during an attack."
        },
        {
            "technique": "T1213 - Data from Information Repositories",
            "reason": "The attacker uses the GetCostAndUsage API to access billing and usage metrics stored in the AWS CostExplorer service. This data is collected to understand the financial and resource allocation details of the target environment."
        },
        {
            "technique": "T1071.001 - Application Layer Protocol: Web Protocols",
            "reason": "The attacker uses web protocols (e.g., HTTPS) to interact with the CostExplorer service and retrieve cost and usage metrics. The data collected is then sent over the web protocol to a remote server controlled by the attacker."
        },
        {
            "technique": "T1020 - Automated Exfiltration",
            "reason": "The attacker scripts the retrieval of cost and usage metrics using the GetCostAndUsage API. This script regularly exfiltrates data, providing continuous updates to the attacker on the victim's cloud usage patterns."
        },
        {
            "technique": "T1530 - Data from Cloud Storage Object",
            "reason": "The attacker stores the retrieved cost and usage data in a cloud storage object (e.g., S3 bucket). This stored data is later accessed or transferred to the attacker's own environment for further analysis or sale."
        }
    ],
    "usedInWild": true,
    "incidents": [
        {
            "description": "When a Zero Day and Access Keys Collide in the Cloud: Responding to the SugarCRM Zero-Day Vulnerability",
            "link": "https://unit42.paloaltonetworks.com/sugarcrm-cloud-incident-black-hat/"
        },
        {
            "description": "Crimson Collective: A New Threat Group Observed Operating in the Cloud",
            "link": "https://www.rapid7.com/blog/post/tr-crimson-collective-a-new-threat-group-observed-operating-in-the-cloud/"
        }
    ],
    "researchLinks": [],
    "securityImplications": "Attackers might use GetCostAndUsage to determine how active an account is by understanding the cost within a cloud account.",
    "alerting": [],
    "simulation": [
        {
            "type": "commandLine",
            "value": "aws ce get-cost-and-usage --time-period Start=2017-09-01,End=2017-10-01 --granularity MONTHLY --metrics 'BlendedCost' 'UnblendedCost' 'UsageQuantity' --group-by Type=DIMENSION,Key=SERVICE Type=TAG,Key=Environment"
        }
    ],
    "permissions": "https://aws.permissions.cloud/iam/ce#ce-GetCostAndUsage"
}
