{
    "eventName": "CreateKeyPair",
    "eventSource": "ec2.amazonaws.com",
    "awsService": "EC2",
    "description": "Creates an ED25519 or 2048-bit RSA key pair with the specified name and in the specified PEM or PPK format.",
    "mitreAttackTactics": [
        "TA0003 - Persistence"
    ],
    "mitreAttackTechniques": [
        "T1098 - Account Manipulation"
    ],
    "mitreAttackSubTechniques": [
        "T1098.001 - Account Manipulation: Additional Cloud Credentials"
    ],
    "unverifiedMitreAttackTechniques": [
        {
            "technique": "T1078 - Valid Accounts",
            "reason": "The creation of a new key pair can facilitate unauthorized access to cloud accounts if an attacker obtains the private key, allowing them to log in and perform actions within the compromised account. By creating a new key pair, attackers can establish valid accounts that can be used to maintain access and evade detection, as the access looks legitimate. Similar to cloud accounts, valid local accounts can be exploited if the attacker uses the key pair to gain access to specific instances or services within the local environment. If the key pair is used to authenticate to domain accounts within the cloud environment, it can provide attackers with persistent access to those accounts, facilitating further malicious activities."
        },
        {
            "technique": "T1562 - Impair Defense",
            "reason": "An attacker with a newly created key pair might use it to disable security tools or modify settings within the cloud environment to avoid detection and maintain persistence."
        },
        {
            "technique": "T1552 - Unsecured Credentials",
            "reason": "The private key returned is unencrypted, which poses a risk if intercepted or improperly stored, leading to potential credential exposure. The private key might be stored in files within the cloud instances, which could be exploited by an attacker to gain unauthorized access."
        },
        {
            "technique": "T1040 - Network Sniffing",
            "reason": "If the private key is transmitted over the network in plaintext, it can be intercepted by an attacker, leading to credential access."
        },
        {
            "technique": "T1530 - Data from Cloud Storage Object",
            "reason": "If the EC2 instance has permissions to access Cloud storage, the key can be used to get this data via the EC2 permissions"
        },
        {
            "technique": "T1212 - Exploitation for Credential Access",
            "reason": "An attacker might exploit the creation and handling of key pairs to gain access to credentials if there are vulnerabilities or misconfigurations in how the keys are managed and stored."
        },
        {
            "description": "My AWS Account Got Hacked - Here Is What Happened",
            "link": "https://zviwex.com/posts/aws-account-hacked"
        }
    ],
    "usedInWild": true,
    "incidents": [
        {
            "description": "The curious case of DangerDev@protonmail.me",
            "link": "https://www.invictus-ir.com/news/the-curious-case-of-dangerdev-protonmail-me"
        },
        {
            "description": "ANATOMY OF AN ATTACK: EXPOSED KEYS TO CRYPTO MINING",
            "link": "https://permiso.io/blog/s/anatomy-of-attack-exposed-keys-to-crypto-mining/"
        },
        {
            "description": "UNMASKING GUI-VIL: FINANCIALLY MOTIVATED CLOUD THREAT ACTOR",
            "link": "https://permiso.io/blog/s/unmasking-guivil-new-cloud-threat-actor/"
        },
        {
            "description": "Leaked Environment Variables Allow Large-Scale Extortion Operation in Cloud Environments",
            "link": "https://unit42.paloaltonetworks.com/large-scale-cloud-extortion-operation/"
        }
    ],
    "researchLinks": [
        {
            "description": "Following attackers’ (Cloud)trail in AWS: Methodology and findings in the wild",
            "link": "https://securitylabs.datadoghq.com/articles/following-attackers-trail-in-aws-methodology-findings-in-the-wild/"
        }
    ],
    "securityImplications": "Attackers might use CreateKeyPair to generate keys that can latter be used to access EC2s.",
    "alerting": [],
    "simulation": [
        {
            "type": "commandLine",
            "value": "aws ec2 create-key-pair --key-name TrailDiscoverKeyPair"
        }
    ],
    "permissions": "https://aws.permissions.cloud/iam/ec2#ec2-CreateKeyPair"
}