{
    "eventName": "CreateImage",
    "eventSource": "ec2.amazonaws.com",
    "awsService": "EC2",
    "description": "Creates an Amazon EBS-backed AMI from an Amazon EBS-backed instance that is either running or stopped.",
    "mitreAttackTactics": [
        "TA0010 - Exfiltration"
    ],
    "mitreAttackTechniques": [
        "T1537 - Transfer Data to Cloud Account"
    ],
    "mitreAttackSubTechniques": [],
    "unverifiedMitreAttackTechniques": [
        {
            "technique": "T1003 - OS Credential Dumping",
            "reason": "Attackers can create an AMI, then analyze the offline image to perform credential dumping, extracting sensitive information from the instance's filesystem"
        },
        {
            "technique": "T1562 - Impair Defenses",
            "reason": "Attackers can create an AMI from an instance, disable or alter security tools and configurations within the AMI, and redeploy the compromised AMI to evade detection and maintain control."
        },
        {
            "technique": "T1578 - Modify Cloud Compute Infrastructure",
            "reason": "Creating an AMI involves creating a snapshot of the instance's state. Attackers can use this snapshot to capture and analyze the data and configurations of the instance, which may include sensitive information or enable further attacks."
        },
        {
            "technique": "T1098 - Account Manipulation",
            "reason": "Attackers can use the CreateImage API to create an AMI from an instance they control. This AMI can then be used to deploy new instances with pre-configured settings, including backdoors or other malicious configurations, effectively manipulating accounts and resources within the cloud environment."
        }
    ],
    "usedInWild": true,
    "incidents": [
        {
            "description": "When a Zero Day and Access Keys Collide in the Cloud: Responding to the SugarCRM Zero-Day Vulnerability",
            "link": "https://unit42.paloaltonetworks.com/sugarcrm-cloud-incident-black-hat/"
        }
    ],
    "researchLinks": [],
    "securityImplications": "Attackers might use CreateImage to create images from running EC2s and use them after adding their own keys",
    "alerting": [],
    "simulation": [
        {
            "type": "commandLine",
            "value": "aws ec2 create-image --instance-id TrailDiscoverInstanceId --name \"TrailDiscoverImageName\" --description \"TrailDiscoverImageDescription\""
        }
    ],
    "permissions": "https://aws.permissions.cloud/iam/ec2#ec2-CreateImage"
}