{
    "eventName": "DescribeVpcs",
    "eventSource": "ec2.amazonaws.com",
    "awsService": "EC2",
    "description": "Describes one or more of your VPCs.",
    "mitreAttackTactics": [
        "TA0007 - Discovery"
    ],
    "mitreAttackTechniques": [
        "T1580 - Cloud Infrastructure Discovery"
    ],
    "mitreAttackSubTechniques": [],
    "unverifiedMitreAttackTechniques": [
        {
            "technique": "T1016 - System Network Configuration Discovery",
            "reason": "Understanding the network configuration by querying VPCs helps an attacker identify the architecture, including subnets, route tables, and network ACLs. This information can reveal how the network is structured and potential points for further exploitation."
        },
        {
            "technique": "T1040 - Network Sniffing",
            "reason": "By describing the VPCs, attackers can identify potential points of network sniffing to capture valuable information traversing the network."
        },
        {
            "technique": "T1087 - Account Discovery",
            "reason": "Understanding the VPCs helps in mapping out the cloud environment, potentially identifying accounts that manage or are associated with those VPCs."
        },
        {
            "technique": "T1482 - Domain Trust Discovery",
            "reason": "By describing VPCs, adversaries can identify trusts between different VPCs or between on-premises and cloud environments, aiding lateral movement and privilege escalation attempts."
        },
        {
            "technique": "T1590 - Gather Victim Network Information",
            "reason": "Describing VPCs directly aligns with gathering information about cloud network configurations, including CIDR blocks, subnets, and associated components."
        },
        {
            "technique": "T1526 - Cloud Service Discovery",
            "reason": "Discovering details about VPCs is part of a broader effort to map out cloud services and their configurations, providing a clearer picture of the cloud environment's landscape."
        }
    ],
    "usedInWild": true,
    "incidents": [
        {
            "description": "Following attackers’ (Cloud)trail in AWS: Methodology and findings in the wild",
            "link": "https://securitylabs.datadoghq.com/articles/following-attackers-trail-in-aws-methodology-findings-in-the-wild/"
        },
        {
            "description": "Crimson Collective: A New Threat Group Observed Operating in the Cloud",
            "link": "https://www.rapid7.com/blog/post/tr-crimson-collective-a-new-threat-group-observed-operating-in-the-cloud/"
        }
    ],
    "researchLinks": [],
    "securityImplications": "Attackers might use DescribeVpcs to enumerate all Virtual Private Clouds (VPCs) within an AWS environment, aiming to map out network architectures.",
    "alerting": [],
    "simulation": [
        {
            "type": "commandLine",
            "value": "aws ec2 describe-vpcs --vpc-ids TrailDiscoverVpcId"
        }
    ],
    "permissions": "https://aws.permissions.cloud/iam/ec2#ec2-DescribeVpcs"
}
