{
    "eventName": "DescribeImages",
    "eventSource": "ec2.amazonaws.com",
    "awsService": "EC2",
    "description": "Describes the specified images (AMIs, AKIs, and ARIs) available to you or all of the images available to you.",
    "mitreAttackTactics": [
        "TA0007 - Discovery"
    ],
    "mitreAttackTechniques": [
        "T1580 - Cloud Infrastructure Discovery"
    ],
    "mitreAttackSubTechniques": [

    ],
    "unverifiedMitreAttackTechniques": [
        {
            "technique": "T1496 - Resource Hijacking",
            "reason": "By understanding the available images, an attacker could hijack resources by creating instances using these images for malicious activities such as cryptocurrency mining."
        },
        {
            "technique": "T1027 - Obfuscated Files or Information",
            "reason": "Attackers can use knowledge about available images to obfuscate their activities by using less monitored or unusual images"
        },
        {
            "technique": "T1562 - Impair Defenses",
            "reason": "By identifying specific images that might have security tools, attackers can choose to avoid those images or disable the security tools present in them"
        },
        {
            "technique": "T1082 - System Information Discovery",
            "reason": "DescribeImages can be used to gather detailed information about the system images in use, which is critical for planning further attacks or understanding the environment."
        },
        {
            "technique": "T1202 - Indirect Command Execution",
            "reason": "By using DescribeImages, attackers can identify images that may allow them to indirectly execute commands through specific software or configurations present in the images"
        },
        {
            "technique": "T1608 - Stage Capabilities",
            "reason": "An attacker might use DescribeImages to find specific images to stage capabilities like installing digital certificates on chosen instances."
        },
        {
            "technique": "T1083 - File and Directory Discovery",
            "reason": "DescribeImages can reveal the existence and properties of files and directories associated with specific AMIs, aiding in discovery efforts"
        },
        {
            "technique": "T1613 - Container and Resource Discovery",
            "reason": "Attackers can use DescribeImages to identify available container images and resources in the environment. This helps them understand the infrastructure and identify potential targets for exploitation within containerized applications."
        },
        {
            "technique": "T1526 - Cloud Service Discovery",
            "reason": "Using DescribeImages helps attackers discover available cloud services, their configurations, and associated resources."
        },
        {
            "technique": "T1195 - Supply Chain Compromise",
            "reason": "Attackers can use DescribeImages to identify and exploit vulnerabilities in the software dependencies and development tools used within specific images, leading to a supply chain compromise"
        }
    ],
    "usedInWild": true,
    "incidents": [
        {
            "description": "Compromised Cloud Compute Credentials: Case Studies From the Wild",
            "link": "https://unit42.paloaltonetworks.com/compromised-cloud-compute-credentials/#post-125981-_kdq0vw6banab"
        }
    ],
    "researchLinks": [],
    "securityImplications": "Attackers might use DescribeImages to identify AMIs (Amazon Machine Images) within AWS.",
    "alerting": [],
    "simulation": [
        {
            "type": "commandLine",
            "value": "aws ec2 describe-images --filters Name=name,Values=TrailDiscover"
        }
    ],
    "permissions": "https://aws.permissions.cloud/iam/ec2#ec2-DescribeImages"
}