{
    "eventName": "GetPasswordData",
    "eventSource": "ec2.amazonaws.com",
    "awsService": "EC2",
    "description": "Retrieves the encrypted administrator password for a running Windows instance.",
    "mitreAttackTactics": [
        "TA0006 - Credential Access"
    ],
    "mitreAttackTechniques": [
        "T1555 - Credentials from Password Stores"
    ],
    "mitreAttackSubTechniques": [

    ],
    "unverifiedMitreAttackTechniques": [
        {
            "technique": "T1078 - Valid Accounts",
            "reason": "By decrypting the administrator password with the key pair, an attacker can obtain valid credentials for the Windows instance, allowing them to log in with legitimate access. z If the Windows instance is part of a domain, obtaining the administrator password could provide domain-level access, enabling further exploitation within the domain. The password retrieved is for the local administrator account, giving full access to the instance's local resources and potentially allowing further escalation."
        },
        {
            "technique": "T1098 - Account Manipulation",
            "reason": "Attackers can use the retrieved administrator credentials to create new accounts or manipulate existing ones to ensure continued access to the instance."
        },
        {
            "technique": "T1531 - Account Access Removal",
            "reason": "With the administrator password, an attacker can remove access to existing accounts, locking out legitimate users and maintaining control over the instance."
        },
        {
            "technique": "T1548.002 - Abuse Elevation Control Mechanism",
            "reason": "Once an attacker has the administrator password, they can bypass User Account Control (UAC) on the instance to elevate privileges without user consent."
        },
        {
            "technique": "T1070 - Indicator Removal",
            "reason": "An attacker with administrator access might delete logs and other files to cover their tracks and ensure persistent access without detection."
        }
    ],
    "usedInWild": true,
    "incidents": [
        {
            "description": "Tales from the cloud trenches: Amazon ECS is the new EC2 for crypto mining",
            "link": "https://securitylabs.datadoghq.com/articles/tales-from-the-cloud-trenches-ecs-crypto-mining/"
        },
        {
            "description": "Behind the scenes in the Expel SOC: Alert-to-fix in AWS",
            "link": "https://expel.com/blog/behind-the-scenes-expel-soc-alert-aws/"
        },
        {
            "description": "When a Zero Day and Access Keys Collide in the Cloud: Responding to the SugarCRM Zero-Day Vulnerability",
            "link": "https://unit42.paloaltonetworks.com/sugarcrm-cloud-incident-black-hat/"
        },
        {
            "description": "Compromised Cloud Compute Credentials: Case Studies From the Wild",
            "link": "https://unit42.paloaltonetworks.com/compromised-cloud-compute-credentials/#post-125981-_kdq0vw6banab"
        }
    ],
    "researchLinks": [],
    "securityImplications": "Attackers might use GetPasswordData to retrieve the password data for Windows instances, allowing unauthorized access.",
    "alerting": [],
    "simulation": [
        {
            "type": "commandLine",
            "value": "aws ec2 get-password-data --instance-id TrailDiscoverInstanceId"
        },
        {
            "type": "stratusRedTeam",
            "value": "https://stratus-red-team.cloud/attack-techniques/AWS/aws.credential-access.ec2-get-password-data"
        }
    ],
    "permissions": "https://aws.permissions.cloud/iam/ec2#ec2-GetPasswordData"
}