{
    "eventName": "ModifyImageAttribute",
    "eventSource": "ec2.amazonaws.com",
    "awsService": "EC2",
    "description": "Modifies the specified attribute of the specified AMI.",
    "mitreAttackTactics": [
        "TA0010 - Exfiltration"
    ],
    "mitreAttackTechniques": [
        "T1537 - Transfer Data to Cloud Account"
    ],
    "mitreAttackSubTechniques": [

    ],
    "unverifiedMitreAttackTechniques": [
        {
            "technique": "T1098 - Account Manipulation",
            "reason": "Modifying AMI launch permissions could allow an attacker to grant additional cloud accounts the ability to launch instances with the compromised AMI."
        },
        {
            "technique": "T1078 - Valid Accounts",
            "reason": "Adjusting launch permissions can be a method for attackers to use or create valid cloud accounts to maintain persistent access to instances based on the modified AMI."
        },
        {
            "technique": "T1562 - Impair Defenses",
            "reason": "By controlling who can launch the AMI, attackers can ensure that their tools embedded in the AMI are not easily discovered or disabled by defensive mechanisms."
        },
        {
            "technique": "T1003 - OS Credential Dumping",
            "reason": "Changing launch permissions to grant attackers access to instances where they can execute credential dumping tools."
        },
        {
            "technique": "T1021 - Remote Services",
            "reason": "If the AMI is launched by specific users, it could enable the attacker to move laterally by exploiting remote services and admin privileges."
        },
        {
            "technique": "T1106 - Native API",
            "reason": "Modified AMI might include scripts or tools that leverage native AWS APIs for continued access and evasion."
        },
        {
            "technique": "T1578 - Modify Cloud Compute Infrastructure",
            "reason": "Attackers could use the modified launch permissions to create snapshots of instances running the AMI for data exfiltration or further exploitation."
        },
        {
            "technique": "T1036 - Masquerading",
            "reason": "By modifying the AMI description, attackers can disguise malicious activities under benign-sounding descriptions to evade detection."
        }
    ],
    "usedInWild": false,
    "incidents": [],
    "researchLinks": [
        {
            "description": "AWS AMI Atttribute Modification for Exfiltration",
            "link": "https://research.splunk.com/cloud/f2132d74-cf81-4c5e-8799-ab069e67dc9f/"
        }
    ],
    "securityImplications": "Attackers might use ModifyImageAttribute to alter permissions or settings of Amazon Machine Images (AMIs), potentially exposing them to unauthorized users or making them public.",
    "alerting": [],
    "simulation": [
        {
            "type": "commandLine",
            "value": "aws ec2 modify-image-attribute --image-id TrailDiscoverImageId --attribute TrailDiscoverAttribute --value TrailDiscoverValue"
        },
        {
            "type": "stratusRedTeam",
            "value": "https://stratus-red-team.cloud/attack-techniques/AWS/aws.exfiltration.ec2-share-ami"
        }
    ],
    "permissions": "https://aws.permissions.cloud/iam/ec2#ec2-ModifyImageAttribute"
}