{
    "eventName": "ModifySnapshotAttribute",
    "eventSource": "ec2.amazonaws.com",
    "awsService": "EC2",
    "description": "Adds or removes permission settings for the specified snapshot.",
    "mitreAttackTactics": [
        "TA0010 - Exfiltration"
    ],
    "mitreAttackTechniques": [
        "T1537 - Transfer Data to Cloud Account"
    ],
    "mitreAttackSubTechniques": [],
    "unverifiedMitreAttackTechniques": [
        {
            "technique": "T1078 - Valid Accounts",
            "reason": "By adding permissions to a snapshot, attackers can grant access to unauthorized cloud accounts or default accounts, which can be used for persistence and privilege escalation."
        },
        {
            "technique": "T1552 - Unsecured Credentials",
            "reason": "Adding permissions to a snapshot might expose sensitive files that contain credentials, aiding in credential access."
        },
        {
            "technique": "T1070 - Indicator Removal",
            "reason": "Removing permissions from a snapshot can be used to hide or delete evidence of unauthorized access, aiding in defense evasion."
        },
        {
            "technique": "T1530 - Data from Cloud Storage",
            "reason": "By modifying snapshot permissions, attackers can gain access to sensitive data stored within snapshots, aiding in data collection and exfiltration."
        },
        {
            "technique": "T1562 - Impair Defenses",
            "reason": "Modifying permissions could impair security controls or defenses by granting unauthorized access to the snapshots, potentially containing security-related configurations, backups, or tools."
        },
        {
            "technique": "T1087 - Account Discovery",
            "reason": "Modifying snapshot permissions could help attackers discover cloud accounts with access to the snapshot, aiding in further attacks."
        },
        {
            "technique": "T1003 - OS Credential Dumping",
            "reason": "If a snapshot contains OS-level files, attackers can use it to extract credentials, aiding in credential access."
        },
        {
            "technique": "T1074 - Data Staged",
            "reason": "Snapshots can be used to stage data locally for later exfiltration, aiding in data collection and exfiltration"
        }
    ],
    "usedInWild": true,
    "incidents": [
        {
            "description": "CrowdStrike’s work with the Democratic National Committee: Setting the record straight",
            "link": "https://www.crowdstrike.com/blog/bears-midst-intrusion-democratic-national-committee/"
        }
    ],
    "researchLinks": [],
    "securityImplications": "Attackers might use ModifySnapshotAttribute to change permissions on Amazon EBS snapshots, potentially making them accessible to unauthorized users or public.",
    "alerting": [
        {
            "type": "sigma",
            "value": "https://github.com/SigmaHQ/sigma/blob/master/rules/cloud/aws/cloudtrail/aws_snapshot_backup_exfiltration.yml"
        }
    ],
    "simulation": [
        {
            "type": "commandLine",
            "value": "aws ec2 modify-snapshot-attribute --snapshot-id snap-046281ab24d756c50 --attribute createVolumePermission --operation-type remove --user-ids 123456789012"
        },
        {
            "type": "stratusRedTeam",
            "value": "https://stratus-red-team.cloud/attack-techniques/AWS/aws.exfiltration.ec2-share-ebs-snapshot"
        }
    ],
    "permissions": "https://aws.permissions.cloud/iam/ec2#ec2-ModifySnapshotAttribute"
}
