{
    "eventName": "GetQueryResults",
    "eventSource": "athena.amazonaws.com",
    "awsService": "Athena",
    "description": "Streams the results of a single query execution specified by QueryExecutionId from the Athena query results location in Amazon S3.",
    "mitreAttackTactics": [
        "TA0007 - Discovery"
    ],
    "mitreAttackTechniques": [
        "T1580 - Cloud Infrastructure Discovery"
    ],
    "mitreAttackSubTechniques": [],
    "unverifiedMitreAttackTechniques": [
        {
            "technique": "T1082 - System Information Discovery",
            "reason": "GetQueryResults can be used to gather information about the Athena environment, such as the metadata of the queries and databases. This can reveal insights about the system configuration and the types of data stored."
        },
        {
            "technique": "T1213 - Data from Information Repositories",
            "reason": "Athena queries can access and retrieve data from various repositories like S3. GetQueryResults is used to obtain this data, making it a critical step in extracting information from these repositories."
        },
        {
            "technique": "T1039 - Data from Network Shared Drive",
            "reason": "If Athena queries target data stored in network shared drives (like those mounted on EC2 instances and accessible via S3), the GetQueryResults API will be used to collect this data."
        },
        {
            "technique": "T1074 - Data Staged",
            "reason": "Attackers may stage data in a specific location after retrieving it with GetQueryResults before exfiltration. This staging is a preparatory step for further data handling or analysis."
        }
    ],
    "usedInWild": true,
    "incidents": [
        {
            "description": "Compromised Cloud Compute Credentials: Case Studies From the Wild",
            "link": "https://unit42.paloaltonetworks.com/compromised-cloud-compute-credentials/#post-125981-_kdq0vw6banab"
        }
    ],
    "researchLinks": [],
    "securityImplications": "Attackers might use GetQueryResults from Amazon Athena to illicitly access and read potential sensitive data.",
    "alerting": [],
    "simulation": [
        {
            "type": "commandLine",
            "value": "N/A"
        }
    ],
    "permissions": "https://aws.permissions.cloud/iam/athena#athena-GetQueryResults"
}
