{
    "eventName": "PutObject",
    "eventSource": "s3.amazonaws.com",
    "awsService": "S3",
    "description": "Adds an object to a bucket.",
    "mitreAttackTactics": [
        "TA0040 - Impact"
    ],
    "mitreAttackTechniques": [
        "T1565 - Data Manipulation"
    ],
    "mitreAttackSubTechniques": [

    ],
    "unverifiedMitreAttackTechniques": [
        {
            "technique": "T1074 - Data Staged",
            "reason": "The PutObject API call can be used to store objects in S3 as a staging area for data that might be collected or processed before exfiltration or further use."
        },
        {
            "technique": "T1070 - Indicator Removal",
            "reason": "Attackers can use PutObject to overwrite existing objects with benign data or to modify metadata, helping to conceal malicious activity by removing indicators of compromise within cloud storage."
        },
        {
            "technique": "T1105 - Ingress Tool Transfer",
            "reason": "The PutObject API can be used to transfer tools or malicious binaries into an S3 bucket, facilitating their retrieval and execution elsewhere in the environment."
        },
        {
            "technique": "T1036 - Masquerading",
            "reason": "Attackers could upload objects with names or metadata that mimic legitimate files using the PutObject API, making malicious content harder to detect."
        },
        {
            "technique": "T1485 - Data Destruction",
            "reason": "The PutObject API could be used to overwrite critical objects, leading to data loss or destruction, particularly if previous versions are not preserved."
        },
        {
            "technique": "T1027 - Obfuscated Files or Information",
            "reason": "Attackers can use PutObject to upload files containing hidden or obfuscated data (e.g., within images), supporting defense evasion."
        },
        {
            "technique": "T1570 - Lateral Tool Transfer",
            "reason": "Objects added to an S3 bucket via PutObject can be used to transfer tools or payloads across different cloud environments, supporting lateral movement within compromised infrastructure."
        }
    ],
    "usedInWild": true,
    "incidents": [
        {
            "description": "Incident Report: TaskRouter JS SDK Security Incident - July 19, 2020",
            "link": "https://www.twilio.com/en-us/blog/incident-report-taskrouter-js-sdk-july-2020"
        },
        {
            "description": "LA Times homicide website throttles cryptojacking attack",
            "link": "https://www.tripwire.com/state-of-security/la-times-website-cryptojacking-attack"
        }
    ],
    "researchLinks": [],
    "securityImplications": "Attackers might use PutObject to upload malicious content or overwrite existing files in S3 buckets.",
    "alerting": [],
    "simulation": [
        {
            "type": "commandLine",
            "value": "N/A"
        }
    ],
    "permissions": "https://aws.permissions.cloud/iam/s3#s3-PutObject"
}