{
    "eventName": "AssociateAccessPolicy",
    "eventSource": "eks.amazonaws.com",
    "awsService": "EKS",
    "description": "Associates an access policy and its scope to an access entry.",
    "mitreAttackTactics": [
        "TA0004 - Privilege Escalation"
    ],
    "mitreAttackTechniques": [
        "T1098 - Account Manipulation"
    ],
    "mitreAttackSubTechniques": [],
    "unverifiedMitreAttackTechniques": [
        {
            "technique": "T1078 - Valid Accounts",
            "reason": "By associating an access policy, attackers can use legitimate credentials to access the system, either by modifying existing ones or changing permissions."
        },
        {
            "technique": "T1543 - Create or Modify System Process",
            "reason": "Associating an access policy can be used to modify the permissions of processes within the EKS environment, ensuring the attacker retains control or gains elevated privileges for their processes."
        },
        {
            "technique": "T1070 - Indicator Removal",
            "reason": "Associating access policies can assist attackers in evading detection by allowing them to remove or alter logs and other indicators that track account and permission changes, thereby obscuring their activities."
        },
        {
            "technique": "T1003 - OS Credential Dumping",
            "reason": "Modifying access policies might allow attackers to gain access to sensitive areas of the system where they can extract credentials."
        },
        {
            "technique": "T1071 - Application Layer Protocol",
            "reason": "Associating new access policies can help attackers use application layer protocols more effectively to communicate with compromised systems, especially if these policies grant access to necessary network services."
        }
    ],
    "usedInWild": false,
    "incidents": [],
    "researchLinks": [
        {
            "description": "New attack vectors in EKS",
            "link": "https://www.wiz.io/blog/new-attack-vectors-emerge-via-recent-eks-access-entries-and-pod-identity-features"
        }
    ],
    "securityImplications": "Attackers might use AssociateAccessPolicy to escalate privileges by linking access entries with highly privileged policies, allowing unauthorized control over clusters.",
    "alerting": [],
    "simulation": [
        {
            "type": "commandLine",
            "value": "aws eks associate-access-policy --cluster-name beta-fish --principal-arn arn:aws:iam::111122223333:role/TrailDiscover --policy-arn arn:aws:eks::aws:cluster-access-policy/AmazonEKSViewPolicy --access-scope type=cluster"
        }
    ],
    "permissions": "https://aws.permissions.cloud/iam/eks#eks-AssociateAccessPolicy"
}
