{
    "eventName": "DescribeLoadBalancers",
    "eventSource": "elasticloadbalancing.amazonaws.com",
    "awsService": "ELBv2",
    "description": "Describes the specified load balancers or all of your load balancers.",
    "mitreAttackTactics": [
        "TA0007 - Discovery"
    ],
    "mitreAttackTechniques": [
        "T1526 - Cloud Service Discovery"
    ],
    "mitreAttackSubTechniques": [],
    "unverifiedMitreAttackTechniques": [
        {
            "technique": "T1580 - Cloud Infrastructure Discovery",
            "reason": "The DescribeLoadBalancers API call directly provides information about the cloud infrastructure, specifically the load balancers, which can be used to understand the deployment and configurations of network resources in the cloud."
        },
        {
            "technique": "T1590 - Gather Victim Network Information",
            "reason": "Describing load balancers allows an adversary to obtain details on how network traffic is managed and routed within the cloud environment. This information can reveal critical network components and their configurations."
        },
        {
            "technique": "T1046 - Network Service Discovery",
            "reason": "Describing load balancers can reveal the network services that are being managed by these load balancers, including ports, protocols, and the IP ranges used, which are crucial for understanding the network service layout."
        },
        {
            "technique": "T1133 - External Remote Services",
            "reason": "Load balancers often manage external access to services. By describing them, an adversary can identify the external endpoints and understand how remote services are being accessed and managed."
        },
        {
            "technique": "T1482 - Domain Trust Discovery",
            "reason": "The DescribeLoadBalancers API call can provide information on how load balancers are configured across different domains, revealing trust relationships and how traffic is managed between different parts of the network."
        }
    ],
    "usedInWild": false,
    "incidents": [
        {
            "description": "Crimson Collective: A New Threat Group Observed Operating in the Cloud",
            "link": "https://www.rapid7.com/blog/post/tr-crimson-collective-a-new-threat-group-observed-operating-in-the-cloud/"
        }
    ],
    "researchLinks": [
        {
            "description": "Rigging the Rules: Manipulating AWS ALB to Mine Sensitive Data",
            "link": "https://medium.com/@adan.alvarez/rigging-the-rules-manipulating-aws-alb-to-mine-sensitive-data-20e33dbc4994"
        }
    ],
    "securityImplications": "Attackers might use DescribeLoadBalancers to get information about the load balancers for potential future attacks.",
    "alerting": [],
    "simulation": [
        {
            "type": "commandLine",
            "value": "aws elbv2 describe-load-balancers --names TrailDiscoverLoadBalancer"
        }
    ],
    "permissions": "https://aws.permissions.cloud/iam/elasticloadbalancing#elasticloadbalancing-DescribeLoadBalancers"
}