{
    "eventName": "ModifyDBSnapshotAttribute",
    "eventSource": "rds.amazonaws.com",
    "awsService": "RDS",
    "description": "Adds an attribute and values to, or removes an attribute and values from, a manual DB snapshot.",
    "mitreAttackTactics": [
        "TA0010 - Exfiltration"
    ],
    "mitreAttackTechniques": [
        "T1537 - Transfer Data to Cloud Account"
    ],
    "mitreAttackSubTechniques": [],
    "unverifiedMitreAttackTechniques": [
        {
            "technique": "T1078 - Valid Accounts",
            "reason": "By adding specific AWS account IDs to the ValuesToAdd parameter, an attacker can ensure persistent access to a DB snapshot by authorized accounts."
        },
        {
            "technique": "T1562 - Impair Defenses",
            "reason": "Modifying the snapshot to make it public or share it with specific accounts might bypass certain security controls, aiding in defense evasion."
        },
        {
            "technique": "T1537 - Transfer Data to Cloud Account",
            "reason": "Making a DB snapshot public or sharing it with specific accounts allows unauthorized access, facilitating the exfiltration of sensitive data to an attacker-controlled AWS account."
        },
        {
            "technique": "T1070 - Indicator Removal",
            "reason": "Removing attributes or specific account IDs from the ValuesToAdd parameter can be used to cover tracks by eliminating evidence of unauthorized access."
        },
        {
            "technique": "T1087 - Account Manipulation",
            "reason": "Modifying the attributes to include or exclude certain account IDs is a form of account manipulation, impacting who can access the snapshot."
        },
        {
            "technique": "T1531 - Account Access Removal",
            "reason": "By removing access to certain AWS accounts from the ValuesToAdd parameter, legitimate users may be denied access, contributing to account access removal tactics."
        },
        {
            "technique": "T1071 - Application Layer Protocol",
            "reason": "The API call itself operates over an application layer protocol (typically HTTPS) and can be part of a communication channel used by the attacker to modify and transfer data within the cloud."
        }
    ],
    "usedInWild": true,
    "incidents": [
        {
            "description": "Imperva Security Update",
            "link": "https://www.imperva.com/blog/ceoblog/"
        },
        {
            "description": "When a Zero Day and Access Keys Collide in the Cloud: Responding to the SugarCRM Zero-Day Vulnerability",
            "link": "https://unit42.paloaltonetworks.com/sugarcrm-cloud-incident-black-hat/"
        }
    ],
    "researchLinks": [
        {
            "description": "Stealing an RDS database by creating a snapshot and sharing it",
            "link": "https://securitylabs.datadoghq.com/cloud-security-atlas/attacks/sharing-rds-snapshot/"
        },
        {
            "description": "Hunting AWS RDS security events with Sysdig",
            "link": "https://sysdig.com/blog/aws-rds-security-events-sysdig/"
        }
    ],
    "securityImplications": "Attackers might use ModifyDBSnapshotAttribute to alter database snapshot permissions, potentially gaining unauthorized access to sensitive data via sharing it.",
    "alerting": [],
    "simulation": [
        {
            "type": "commandLine",
            "value": "aws rds modify-db-snapshot-attribute --db-snapshot-identifier TrailDiscoverDBSnapshotIdentifier --attribute-name TrailDiscoverAttributeName --values-to-add TrailDiscoverValuesToAdd"
        },
        {
            "type": "stratusRedTeam",
            "value": "https://stratus-red-team.cloud/attack-techniques/AWS/aws.exfiltration.rds-share-snapshot"
        }
    ],
    "permissions": "https://aws.permissions.cloud/iam/rds#rds-ModifyDBSnapshotAttribute"
}